## 26-05-2025

In [1]:
# Detect and Handle Missing Values

import pandas as pd
import numpy as np

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', np.nan, 'David'],
    'Age': [25, np.nan, 30, 22],
    'Salary': [50000, 60000, 52000, np.nan]
})
df

    Name   Age   Salary
0  Alice  25.0  50000.0
1    Bob   NaN  60000.0
2    NaN  30.0  52000.0
3  David  22.0      NaN

In [2]:
df.isnull().sum()

Name      1
Age       1
Salary    1
dtype: int64

In [3]:
df['Name'].fillna('unknown',inplace=True)

C:\Users\91805\AppData\Local\Temp\ipykernel_6372\3029376215.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Name'].fillna('unknown',inplace=True)

In [4]:
df.isnull().sum()

Name      0
Age       1
Salary    1
dtype: int64

In [5]:
df['Age'].fillna(df['Age'].mean(),inplace=True)

C:\Users\91805\AppData\Local\Temp\ipykernel_6372\694922604.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].mean(),inplace=True)

In [6]:
df.isnull().sum()

Name      0
Age       0
Salary    1
dtype: int64

In [7]:
df['Salary'].fillna(df['Salary'].mean(),inplace=True)

C:\Users\91805\AppData\Local\Temp\ipykernel_6372\2738737218.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(),inplace=True)

In [8]:
df

      Name        Age   Salary
0    Alice  25.000000  50000.0
1      Bob  25.666667  60000.0
2  unknown  30.000000  52000.0
3    David  22.000000  54000.0

In [9]:
# Grouping and Aggregation
import pandas as pd

df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Department': ['HR', 'IT', 'IT', 'Finance', 'HR'],
    'Salary': [50000, 70000, 60000, 65000, 48000]
})
df

      Name Department  Salary
0    Alice         HR   50000
1      Bob         IT   70000
2  Charlie         IT   60000
3    David    Finance   65000
4      Eva         HR   48000

In [10]:
avg_salary=df.groupby('Department')['Salary'].mean().reset_index()

In [11]:
avg_salary

  Department   Salary
0    Finance  65000.0
1         HR  49000.0
2         IT  65000.0

In [12]:
# Identify Top N Entries

import pandas as pd
df = pd.DataFrame({
    'Product': ['A', 'B', 'C', 'D'],
    'Revenue': [2000, 4500, 1500, 3800]
})
df

  Product  Revenue
0       A     2000
1       B     4500
2       C     1500
3       D     3800

In [13]:
top_products=df.sort_values(by='Revenue',ascending=False)
top_products

  Product  Revenue
1       B     4500
3       D     3800
0       A     2000
2       C     1500

In [14]:
#  Find Outliers Using IQR

import pandas as pd

df = pd.DataFrame({
    'Product': ['A', 'B', 'C', 'D'],
    'Revenue': [2000, 4500, 1500, 3800]
})
df

  Product  Revenue
0       A     2000
1       B     4500
2       C     1500
3       D     3800

In [15]:
Q1=df['Revenue'].quantile(0.25)
Q1

1875.0

In [16]:
Q3=df['Revenue'].quantile(0.75)
Q3

3975.0

In [17]:
IQR=Q3-Q1
IQR

2100.0

In [18]:
lower=Q1-1.5*IQR
lower

-1275.0

In [19]:
upper=Q3+1.5*IQR
upper

7125.0

In [21]:
outlier=df[(df['Revenue']<lower) | (df['Revenue']>upper)]
outlier

Empty DataFrame
Columns: [Product, Revenue]
Index: []

In [25]:
# Merge Two DataFrames

import pandas as pd

df1 = pd.DataFrame({
    'Emp_ID': [101, 102, 103],
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Dept_ID': [1, 2, 3]
})
df1

   Emp_ID     Name  Dept_ID
0     101    Alice        1
1     102      Bob        2
2     103  Charlie        3

In [27]:
df2 = pd.DataFrame({
    'Dept_ID': [1, 2, 3],
    'Department': ['HR', 'IT', 'Finance']
})
df2

   Dept_ID Department
0        1         HR
1        2         IT
2        3    Finance

In [28]:
merge_df=pd.merge(df1,df2,on='Dept_ID')
merge_df

   Emp_ID     Name  Dept_ID Department
0     101    Alice        1         HR
1     102      Bob        2         IT
2     103  Charlie        3    Finance

In [30]:
# Time Series: Daily Average from Timestamps

import pandas as pd

df = pd.DataFrame({
    'timestamp': pd.date_range(start='2025-01-01', periods=6, freq='H'),
    'value': [100, 150, 200, 120, 180, 130]
})
df

C:\Users\91805\AppData\Local\Temp\ipykernel_6372\3595894120.py:6: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  'timestamp': pd.date_range(start='2025-01-01', periods=6, freq='H'),

            timestamp  value
0 2025-01-01 00:00:00    100
1 2025-01-01 01:00:00    150
2 2025-01-01 02:00:00    200
3 2025-01-01 03:00:00    120
4 2025-01-01 04:00:00    180
5 2025-01-01 05:00:00    130

In [31]:
df['date']=df['timestamp'].dt.date

In [32]:
daily_avg=df.groupby('date')['value'].mean().reset_index()
daily_avg

         date       value
0  2025-01-01  146.666667

In [33]:
#  E-Commerce: Identify Best-Selling Category

import pandas as pd

df = pd.DataFrame({
    'product_id': [1, 2, 3, 4],
    'category': ['Electronics', 'Clothing', 'Electronics', 'Clothing'],
    'price': [1000, 500, 1200, 700],
    'units_sold': [20, 40, 15, 35]
})
df

   product_id     category  price  units_sold
0           1  Electronics   1000          20
1           2     Clothing    500          40
2           3  Electronics   1200          15
3           4     Clothing    700          35

In [34]:
df['revenue']=df['price']*df['units_sold']
df

   product_id     category  price  units_sold  revenue
0           1  Electronics   1000          20    20000
1           2     Clothing    500          40    20000
2           3  Electronics   1200          15    18000
3           4     Clothing    700          35    24500

In [35]:
best_category=df.groupby('category')['revenue'].sum().reset_index().sort_values(by='revenue',ascending=False)
best_category

      category  revenue
0     Clothing    44500
1  Electronics    38000

In [36]:
# HR Analytics: Monthly Attrition Rate

import pandas as pd

data = pd.DataFrame({
    'emp_id': [1, 2, 3, 4, 5],
    'join_date': pd.to_datetime(['2023-01-01', '2023-02-01', '2023-02-10', '2023-03-01', '2023-03-20']),
    'exit_date': [None, '2023-03-01', None, None, '2023-04-01']
})
data

   emp_id  join_date   exit_date
0       1 2023-01-01        None
1       2 2023-02-01  2023-03-01
2       3 2023-02-10        None
3       4 2023-03-01        None
4       5 2023-03-20  2023-04-01

In [37]:
data['exit_date']=pd.to_datetime(data['exit_date'])
data['attrited']=data['exit_date'].notna()

In [38]:
monthly_attraction=data[data['attrited']].groupby(data['exit_date'].dt.to_period('M')).size()

In [39]:
monthly_attraction

exit_date
2023-03    1
2023-04    1
Freq: M, dtype: int64

## 27-05-2025

In [1]:
# Retail: Average Basket Size

import pandas as pd

df = pd.DataFrame({
    'transaction_id': [101, 101, 102, 103, 103, 103],
    'product_id': [1, 2, 1, 2, 3, 4]
})
df

   transaction_id  product_id
0             101           1
1             101           2
2             102           1
3             103           2
4             103           3
5             103           4

In [2]:
basket_size=df.groupby('transaction_id')['product_id'].count().mean()
basket_size

2.0

In [4]:
#  Finance: Flag Accounts With Suspicious Transactions

import pandas as pd

df = pd.DataFrame({
    'account_id': [111, 112, 113, 114],
    'last_transaction': [5000, 11000, 7500, 25000]
})
df

   account_id  last_transaction
0         111              5000
1         112             11000
2         113              7500
3         114             25000

In [5]:
df['suspicious']=df['last_transaction']>10000
df

   account_id  last_transaction  suspicious
0         111              5000       False
1         112             11000        True
2         113              7500       False
3         114             25000        True

In [6]:
# Education: Student Drop-Off Rate

import pandas as pd

df = pd.DataFrame({
    'student_id': [1, 2, 3, 4, 5],
    'course_completed': [True, False, True, False, False]
})
df

   student_id  course_completed
0           1              True
1           2             False
2           3              True
3           4             False
4           5             False

In [7]:
drop_off_rate=df[~df['course_completed']].shape[0]/df.shape[0]*100
drop_off_rate

60.0